# Binaries
# 'brew install'
brew 'git'
brew 'gnupg' # GnuPG 2 (latest version)
brew 'jq' # command line JSON processor
brew 'lazygit' # terminal UI for git commands
brew 'lolcat' # prettier cat
brew 'mas' # Mac App Store command line interface (latest version)
brew 'nvm' # node version manager
brew 'pinentry-mac' # tool that allow GnuPG to read passphrases
brew 'pnpm' # better npm
brew 'python'
brew 'stow' # symlink manager
brew 'watch' # execute a program periodically
brew 'zsh' # zsh (latest)

# Apps
# 'brew install --cask'
cask 'alfred'
cask 'appcleaner'
cask 'bartender'
cask 'bitwarden' # password manager
cask 'brave-browser'
cask 'datagrip' # IDE for databases and more
cask 'discord' # messaging app
cask 'docker'
cask 'elgato-stream-deck'
cask 'gpg-suite-no-mail'
cask 'intellij-idea'
cask 'iterm2'
cask 'itermai' # iTerm 2 AI features (cmd + y)
cask 'little-snitch'
cask 'logi-options-plus'
cask 'ollama' # local AI
cask 'sourcetree' # git UI
cask 'syncthing'
cask 'todoist'
cask 'veracrypt'
cask 'visual-studio-code'
cask 'zoom'

# App Store
# 'mas install'
mas 'Amphetamine', id: 937984704
mas 'Magnet', id: 441258766
mas 'OTP Auth', id: 1471867429
mas 'reMarkable', id: 1276493162
mas 'Trello', id: 1278508951
mas 'Xcode', id: 497799835


# 'whalebrew install'
# whalebrew "whalebrew/awscli"
# whalebrew "whalebrew/terraform"
# whalebrew "whalebrew/wget"

# 'vscode --install-extension'
vscode 'GitHub.codespaces'
vscode 'Continue.continue' # AI
vscode 'hashicorp.terraform' # Terraform syntax highlighting
vscode 'yzane.markdown-pdf' # Produce PDFs from Markdown
vscode 'myml.vscode-markdown-plantuml-preview' # Markdown preview with PlantUML
vscode 'ms-vscode.powershell' # Powershell support
vscode 'github.vscode-github-actions' # GitHub Actions
vscode 'nicollasr.vscode-streamdeck' # Stream deck plugin
vscode 'Vue.volar' # Vue
vscode 'streetsidesoftware.code-spell-checker'
vscode 'ryu1kn.partial-diff' # Git diffing
vscode 'ms-azuretools.vscode-docker'
